iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.h
  /* Driver methods.*/
  void dma2dInit(void);
  void dma2dObjectInit(DMA2DDriver *dma2dp);
  dma2d_state_t dma2dGetStateI(DMA2DDriver *dma2dp);
  dma2d_state_t dma2dGetState(DMA2DDriver *dma2dp);
  void dma2dStart(DMA2DDriver *dma2dp, const DMA2DConfig *configp);
  void dma2dStop(DMA2DDriver *dma2dp);
#if (TRUE == DMA2D_USE_MUTUAL_EXCLUSION)
  void dma2dAcquireBusS(DMA2DDriver *dma2dp);
  void dma2dAcquireBus(DMA2DDriver *dma2dp);
  void dma2dReleaseBusS(DMA2DDriver *dma2dp);
  void dma2dReleaseBus(DMA2DDriver *dma2dp);
#endif  /* DMA2D_USE_MUTUAL_EXCLUSION */

  /* Global methods.*/
  uint16_t dma2dGetWatermarkPosI(DMA2DDriver *dma2dp);
  uint16_t dma2dGetWatermarkPos(DMA2DDriver *dma2dp);
  void dma2dSetWatermarkPosI(DMA2DDriver *dma2dp, uint16_t line);
  void dma2dSetWatermarkPos(DMA2DDriver *dma2dp, uint16_t line);
  bool dma2dIsWatermarkEnabledI(DMA2DDriver *dma2dp);
  bool dma2dIsWatermarkEnabled(DMA2DDriver *dma2dp);
  void dma2dEnableWatermarkI(DMA2DDriver *dma2dp);
  void dma2dEnableWatermark(DMA2DDriver *dma2dp);
  void dma2dDisableWatermarkI(DMA2DDriver *dma2dp);
  void dma2dDisableWatermark(DMA2DDriver *dma2dp);
  uint32_t dma2dGetDeadTimeI(DMA2DDriver *dma2dp);
  uint32_t dma2dGetDeadTime(DMA2DDriver *dma2dp);
  void dma2dSetDeadTimeI(DMA2DDriver *dma2dp, uint32_t cycles);
  void dma2dSetDeadTime(DMA2DDriver *dma2dp, uint32_t cycles);
  bool dma2dIsDeadTimeEnabledI(DMA2DDriver *dma2dp);
  bool dma2dIsDeadTimeEnabled(DMA2DDriver *dma2dp);
  void dma2dEnableDeadTimeI(DMA2DDriver *dma2dp);
  void dma2dEnableDeadTime(DMA2DDriver *dma2dp);
  void dma2dDisableDeadTimeI(DMA2DDriver *dma2dp);
  void dma2dDisableDeadTime(DMA2DDriver *dma2dp);

  /* Job methods.*/
  dma2d_jobmode_t dma2dJobGetModeI(DMA2DDriver *dma2dp);
  dma2d_jobmode_t dma2dJobGetMode(DMA2DDriver *dma2dp);
  void dma2dJobSetModeI(DMA2DDriver *dma2dp, dma2d_jobmode_t mode);
  void dma2dJobSetMode(DMA2DDriver *dma2dp, dma2d_jobmode_t mode);
  void dma2dJobGetSizeI(DMA2DDriver *dma2dp,
                        uint16_t *widthp, uint16_t *heightp);
  void dma2dJobGetSize(DMA2DDriver *dma2dp,
                       uint16_t *widthp, uint16_t *heightp);
  void dma2dJobSetSizeI(DMA2DDriver *dma2dp, uint16_t width, uint16_t height);
  void dma2dJobSetSize(DMA2DDriver *dma2dp, uint16_t width, uint16_t height);
  bool dma2dJobIsExecutingI(DMA2DDriver *dma2dp);
  bool dma2dJobIsExecuting(DMA2DDriver *dma2dp);
  void dma2dJobStartI(DMA2DDriver *dma2dp);
  void dma2dJobStart(DMA2DDriver *dma2dp);
  void dma2dJobExecuteS(DMA2DDriver *dma2dp);
  void dma2dJobExecute(DMA2DDriver *dma2dp);
  void dma2dJobSuspendI(DMA2DDriver *dma2dp);
  void dma2dJobSuspend(DMA2DDriver *dma2dp);
  void dma2dJobResumeI(DMA2DDriver *dma2dp);
  void dma2dJobResume(DMA2DDriver *dma2dp);
  void dma2dJobAbortI(DMA2DDriver *dma2dp);
  void dma2dJobAbort(DMA2DDriver *dma2dp);

  /* Background layer methods.*/
  void *dma2dBgGetAddressI(DMA2DDriver *dma2dp);
  void *dma2dBgGetAddress(DMA2DDriver *dma2dp);
  void dma2dBgSetAddressI(DMA2DDriver *dma2dp, void *bufferp);
  void dma2dBgSetAddress(DMA2DDriver *dma2dp, void *bufferp);
  size_t dma2dBgGetWrapOffsetI(DMA2DDriver *dma2dp);
  size_t dma2dBgGetWrapOffset(DMA2DDriver *dma2dp);
  void dma2dBgSetWrapOffsetI(DMA2DDriver *dma2dp, size_t offset);
  void dma2dBgSetWrapOffset(DMA2DDriver *dma2dp, size_t offset);
  uint8_t dma2dBgGetConstantAlphaI(DMA2DDriver *dma2dp);
  uint8_t dma2dBgGetConstantAlpha(DMA2DDriver *dma2dp);
  void dma2dBgSetConstantAlphaI(DMA2DDriver *dma2dp, uint8_t a);
  void dma2dBgSetConstantAlpha(DMA2DDriver *dma2dp, uint8_t a);
  dma2d_amode_t dma2dBgGetAlphaModeI(DMA2DDriver *dma2dp);
  dma2d_amode_t dma2dBgGetAlphaMode(DMA2DDriver *dma2dp);
  void dma2dBgSetAlphaModeI(DMA2DDriver *dma2dp, dma2d_amode_t mode);
  void dma2dBgSetAlphaMode(DMA2DDriver *dma2dp, dma2d_amode_t mode);
  dma2d_pixfmt_t dma2dBgGetPixelFormatI(DMA2DDriver *dma2dp);
  dma2d_pixfmt_t dma2dBgGetPixelFormat(DMA2DDriver *dma2dp);
  void dma2dBgSetPixelFormatI(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt);
  void dma2dBgSetPixelFormat(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt);
  dma2d_color_t dma2dBgGetDefaultColorI(DMA2DDriver *dma2dp);
  dma2d_color_t dma2dBgGetDefaultColor(DMA2DDriver *dma2dp);
  void dma2dBgSetDefaultColorI(DMA2DDriver *dma2dp, dma2d_color_t c);
  void dma2dBgSetDefaultColor(DMA2DDriver *dma2dp, dma2d_color_t c);
  void dma2dBgGetPaletteI(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep);
  void dma2dBgGetPalette(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep);
  void dma2dBgSetPaletteS(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep);
  void dma2dBgSetPalette(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep);
  void dma2dBgGetLayerI(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp);
  void dma2dBgGetLayer(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp);
  void dma2dBgSetConfigS(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp);
  void dma2dBgSetConfig(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp);

  /* Foreground layer methods.*/
  void *dma2dFgGetAddressI(DMA2DDriver *dma2dp);
  void *dma2dFgGetAddress(DMA2DDriver *dma2dp);
  void dma2dFgSetAddressI(DMA2DDriver *dma2dp, void *bufferp);
  void dma2dFgSetAddress(DMA2DDriver *dma2dp, void *bufferp);
  size_t dma2dFgGetWrapOffsetI(DMA2DDriver *dma2dp);
  size_t dma2dFgGetWrapOffset(DMA2DDriver *dma2dp);
  void dma2dFgSetWrapOffsetI(DMA2DDriver *dma2dp, size_t offset);
  void dma2dFgSetWrapOffset(DMA2DDriver *dma2dp, size_t offset);
  uint8_t dma2dFgGetConstantAlphaI(DMA2DDriver *dma2dp);
  uint8_t dma2dFgGetConstantAlpha(DMA2DDriver *dma2dp);
  void dma2dFgSetConstantAlphaI(DMA2DDriver *dma2dp, uint8_t a);
  void dma2dFgSetConstantAlpha(DMA2DDriver *dma2dp, uint8_t a);
  dma2d_amode_t dma2dFgGetAlphaModeI(DMA2DDriver *dma2dp);
  dma2d_amode_t dma2dFgGetAlphaMode(DMA2DDriver *dma2dp);
  void dma2dFgSetAlphaModeI(DMA2DDriver *dma2dp, dma2d_amode_t mode);
  void dma2dFgSetAlphaMode(DMA2DDriver *dma2dp, dma2d_amode_t mode);
  dma2d_pixfmt_t dma2dFgGetPixelFormatI(DMA2DDriver *dma2dp);
  dma2d_pixfmt_t dma2dFgGetPixelFormat(DMA2DDriver *dma2dp);
  void dma2dFgSetPixelFormatI(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt);
  void dma2dFgSetPixelFormat(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt);
  dma2d_color_t dma2dFgGetDefaultColorI(DMA2DDriver *dma2dp);
  dma2d_color_t dma2dFgGetDefaultColor(DMA2DDriver *dma2dp);
  void dma2dFgSetDefaultColorI(DMA2DDriver *dma2dp, dma2d_color_t c);
  void dma2dFgSetDefaultColor(DMA2DDriver *dma2dp, dma2d_color_t c);
  void dma2dFgGetPaletteI(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep);
  void dma2dFgGetPalette(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep);
  void dma2dFgSetPaletteS(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep);
  void dma2dFgSetPalette(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep);
  void dma2dFgGetLayerI(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp);
  void dma2dFgGetLayer(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp);
  void dma2dFgSetConfigS(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp);
  void dma2dFgSetConfig(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp);

  /* Output layer methods.*/
  void *dma2dOutGetAddressI(DMA2DDriver *dma2dp);
  void *dma2dOutGetAddress(DMA2DDriver *dma2dp);
  void dma2dOutSetAddressI(DMA2DDriver *dma2dp, void *bufferp);
  void dma2dOutSetAddress(DMA2DDriver *dma2dp, void *bufferp);
  size_t dma2dOutGetWrapOffsetI(DMA2DDriver *dma2dp);
  size_t dma2dOutGetWrapOffset(DMA2DDriver *dma2dp);
  void dma2dOutSetWrapOffsetI(DMA2DDriver *dma2dp, size_t offset);
  void dma2dOutSetWrapOffset(DMA2DDriver *dma2dp, size_t offset);
  dma2d_pixfmt_t dma2dOutGetPixelFormatI(DMA2DDriver *dma2dp);
  dma2d_pixfmt_t dma2dOutGetPixelFormat(DMA2DDriver *dma2dp);
  void dma2dOutSetPixelFormatI(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt);
  void dma2dOutSetPixelFormat(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt);
  dma2d_color_t dma2dOutGetDefaultColorI(DMA2DDriver *dma2dp);
  dma2d_color_t dma2dOutGetDefaultColor(DMA2DDriver *dma2dp);
  void dma2dOutSetDefaultColorI(DMA2DDriver *dma2dp, dma2d_color_t c);
  void dma2dOutSetDefaultColor(DMA2DDriver *dma2dp, dma2d_color_t c);
  void dma2dOutGetLayerI(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp);
  void dma2dOutGetLayer(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp);
  void dma2dOutSetConfigI(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp);
  void dma2dOutSetConfig(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp);

  /* Helper functions.*/
  const void *dma2dComputeAddressConst(const void *originp, size_t pitch,
                                       dma2d_pixfmt_t fmt,
                                       uint16_t x, uint16_t y);
  bool dma2dIsAligned(const void *bufferp, dma2d_pixfmt_t fmt);
  size_t dma2dBitsPerPixel(dma2d_pixfmt_t fmt);
#if (TRUE == DMA2D_USE_SOFTWARE_CONVERSIONS) || defined(__DOXYGEN__)
  dma2d_color_t dma2dFromARGB8888(dma2d_color_t c, dma2d_pixfmt_t fmt);
  dma2d_color_t dma2dToARGB8888(dma2d_color_t c, dma2d_pixfmt_t fmt);
#endif  /* DMA2D_USE_SOFTWARE_CONVERSIONS */

#ifdef __cplusplus
}
#endif

#endif  /* STM32_DMA2D_USE_DMA2D */

#endif  /* _STM32_DMA2D_H_ */

/** @} */
